turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l8/atdf/ATSAM4LC8A.atdf
        <register name="MR" offset="0x38" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Mode Register">
          <bitfield name="ENABLE" caption="CRC Computation Enable" mask="0x1"/>
          <bitfield name="COMPARE" caption="CRC Compare" mask="0x2"/>
          <bitfield name="PTYPE" caption="Polynomial Type" mask="0xC" values="CRCCU_MR__PTYPE"/>
          <bitfield name="DIVIDER" caption="Bandwidth Divider" mask="0xF0"/>
        </register>
        <register name="SR" offset="0x3C" rw="R" size="4" access-size="4" initval="0xFFFFFFFF" caption="Status Register">
          <bitfield name="CRC" caption="Cyclic Redundancy Check Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="IER" offset="0x40" rw="W" size="4" access-size="4" atomic-op="set:IMR" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="ERRIER" caption="CRC Error Interrupt Enable" mask="0x1"/>
        </register>
        <register name="IDR" offset="0x44" rw="W" size="4" access-size="4" atomic-op="clear:IMR" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="ERRIDR" caption="CRC Error Interrupt Disable" mask="0x1"/>
        </register>
        <register name="IMR" offset="0x48" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="ERRIMR" caption="CRC Error Interrupt Mask" mask="0x1"/>
        </register>
        <register name="ISR" offset="0x4C" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="ERRISR" caption="CRC Error Interrupt Status" mask="0x1"/>
        </register>
        <register name="VERSION" offset="0xFC" rw="R" size="4" access-size="4" initval="0x00000202" caption="Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
      </register-group>
      <value-group name="CRCCU_MR__PTYPE">
        <value name="CCITT8023" value="0"/>
        <value name="CASTAGNOLI" value="1"/>
        <value name="CCITT16" value="2"/>
      </value-group>
    </module>
    <module name="DACC" id="I7645" version="1.1.1" caption="DAC Controller">
      <register-group name="DACC" caption="DAC Controller">
        <register name="CR" offset="0x0" rw="W" size="4" access-size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
        </register>
        <register name="MR" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Mode Register">
          <bitfield name="TRGEN" caption="Trigger Enable" mask="0x1"/>
          <bitfield name="TRGSEL" caption="Trigger Selection" mask="0xE"/>
          <bitfield name="DACEN" caption="DAC Enable" mask="0x10"/>
          <bitfield name="WORD" caption="Word Transfer" mask="0x20"/>
          <bitfield name="STARTUP" caption="Startup Time Selection" mask="0xFF00"/>
          <bitfield name="CLKDIV" caption="Clock Divider for Internal Trigger" mask="0xFFFF0000"/>
        </register>
        <register name="CDR" offset="0x8" rw="W" size="4" access-size="4" initval="0x00000000" caption="Conversion Data Register">
          <bitfield name="DATA" caption="Data to Convert" mask="0xFFFFFFFF"/>
        </register>
        <register name="IER" offset="0xC" rw="W" size="4" access-size="4" atomic-op="set:IMR" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="TXRDY" caption="Transmit Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="IDR" offset="0x10" rw="W" size="4" access-size="4" atomic-op="clear:IMR" caption="Interrupt Disable Register">
          <bitfield name="TXRDY" caption="Transmit Ready Interrupt Disable" mask="0x1"/>
        </register>
        <register name="IMR" offset="0x14" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="TXRDY" caption="Transmit Ready Interrupt Mask" mask="0x1"/>
        </register>
        <register name="ISR" offset="0x18" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="TXRDY" caption="Transmit Ready Interrupt Status" mask="0x1"/>
        </register>
        <register name="WPMR" offset="0xE4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Write Protect Mode Register">
          <bitfield name="WPEN" caption="Write Protect Enable" mask="0x1"/>
          <bitfield name="WPKEY" caption="Write Protect Key" mask="0xFFFFFF00"/>
        </register>
        <register name="WPSR" offset="0xE8" rw="R" size="4" access-size="4" initval="0x00000000" caption="Write Protect Status Register">
          <bitfield name="WPROTERR" caption="Write Protection Error" mask="0x1"/>
          <bitfield name="WPROTADDR" caption="Write Protection Error Address" mask="0xFF00"/>
        </register>
        <register name="VERSION" offset="0xFC" rw="R" size="4" access-size="4" initval="0x00000111" caption="Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0x70000"/>
        </register>
      </register-group>
    </module>
    <module name="EDP" id="I8320" version="1.0.0" caption="Enhanced Debug Port For ARM Products">
    </module>
    <module name="EIC" id="I7529" version="3.0.2" caption="External Interrupt Controller">
      <register-group name="EIC" caption="External Interrupt Controller">
        <register name="IER" offset="0x0" rw="W" size="4" access-size="4" atomic-op="set:IMR" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="NMI" caption="External Non Maskable CPU interrupt" mask="0x1"/>
          <bitfield name="INT1" caption="External Interrupt 1" mask="0x2" values="EIC_IER__INT1"/>
          <bitfield name="INT2" caption="External Interrupt 2" mask="0x4" values="EIC_IER__INT2"/>
          <bitfield name="INT3" caption="External Interrupt 3" mask="0x8" values="EIC_IER__INT3"/>
          <bitfield name="INT4" caption="External Interrupt 4" mask="0x10" values="EIC_IER__INT4"/>
          <bitfield name="INT5" caption="External Interrupt 5" mask="0x20"/>
          <bitfield name="INT6" caption="External Interrupt 6" mask="0x40"/>
          <bitfield name="INT7" caption="External Interrupt 7" mask="0x80"/>
          <bitfield name="INT8" caption="External Interrupt 8" mask="0x100"/>
          <bitfield name="INT9" caption="External Interrupt 9" mask="0x200"/>
          <bitfield name="INT10" caption="External Interrupt 10" mask="0x400"/>
          <bitfield name="INT11" caption="External Interrupt 11" mask="0x800"/>
          <bitfield name="INT12" caption="External Interrupt 12" mask="0x1000"/>
          <bitfield name="INT13" caption="External Interrupt 13" mask="0x2000"/>
          <bitfield name="INT14" caption="External Interrupt 14" mask="0x4000"/>
          <bitfield name="INT15" caption="External Interrupt 15" mask="0x8000"/>
        </register>
        <register name="IDR" offset="0x4" rw="W" size="4" access-size="4" atomic-op="clear:IMR" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="NMI" caption="External Non Maskable CPU interrupt" mask="0x1"/>
          <bitfield name="INT1" caption="External Interrupt 1" mask="0x2" values="EIC_IDR__INT1"/>
          <bitfield name="INT2" caption="External Interrupt 2" mask="0x4" values="EIC_IDR__INT2"/>
          <bitfield name="INT3" caption="External Interrupt 3" mask="0x8" values="EIC_IDR__INT3"/>
          <bitfield name="INT4" caption="External Interrupt 4" mask="0x10" values="EIC_IDR__INT4"/>
          <bitfield name="INT5" caption="External Interrupt 5" mask="0x20"/>
          <bitfield name="INT6" caption="External Interrupt 6" mask="0x40"/>
          <bitfield name="INT7" caption="External Interrupt 7" mask="0x80"/>
          <bitfield name="INT8" caption="External Interrupt 8" mask="0x100"/>
          <bitfield name="INT9" caption="External Interrupt 9" mask="0x200"/>
          <bitfield name="INT10" caption="External Interrupt 10" mask="0x400"/>
          <bitfield name="INT11" caption="External Interrupt 11" mask="0x800"/>
          <bitfield name="INT12" caption="External Interrupt 12" mask="0x1000"/>
          <bitfield name="INT13" caption="External Interrupt 13" mask="0x2000"/>
          <bitfield name="INT14" caption="External Interrupt 14" mask="0x4000"/>
          <bitfield name="INT15" caption="External Interrupt 15" mask="0x8000"/>
        </register>
        <register name="IMR" offset="0x8" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="NMI" caption="External Non Maskable CPU interrupt" mask="0x1"/>
          <bitfield name="INT1" caption="External Interrupt 1" mask="0x2" values="EIC_IMR__INT1"/>
          <bitfield name="INT2" caption="External Interrupt 2" mask="0x4" values="EIC_IMR__INT2"/>
          <bitfield name="INT3" caption="External Interrupt 3" mask="0x8" values="EIC_IMR__INT3"/>
          <bitfield name="INT4" caption="External Interrupt 4" mask="0x10" values="EIC_IMR__INT4"/>
          <bitfield name="INT5" caption="External Interrupt 5" mask="0x20"/>
          <bitfield name="INT6" caption="External Interrupt 6" mask="0x40"/>
          <bitfield name="INT7" caption="External Interrupt 7" mask="0x80"/>
          <bitfield name="INT8" caption="External Interrupt 8" mask="0x100"/>
          <bitfield name="INT9" caption="External Interrupt 9" mask="0x200"/>
          <bitfield name="INT10" caption="External Interrupt 10" mask="0x400"/>
          <bitfield name="INT11" caption="External Interrupt 11" mask="0x800"/>
          <bitfield name="INT12" caption="External Interrupt 12" mask="0x1000"/>
          <bitfield name="INT13" caption="External Interrupt 13" mask="0x2000"/>
          <bitfield name="INT14" caption="External Interrupt 14" mask="0x4000"/>
          <bitfield name="INT15" caption="External Interrupt 15" mask="0x8000"/>
        </register>
        <register name="ISR" offset="0xC" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="NMI" caption="External Non Maskable CPU interrupt" mask="0x1"/>
          <bitfield name="INT1" caption="External Interrupt 1" mask="0x2" values="EIC_ISR__INT1"/>
          <bitfield name="INT2" caption="External Interrupt 2" mask="0x4" values="EIC_ISR__INT2"/>
          <bitfield name="INT3" caption="External Interrupt 3" mask="0x8" values="EIC_ISR__INT3"/>
          <bitfield name="INT4" caption="External Interrupt 4" mask="0x10" values="EIC_ISR__INT4"/>
          <bitfield name="INT5" caption="External Interrupt 5" mask="0x20"/>
          <bitfield name="INT6" caption="External Interrupt 6" mask="0x40"/>
          <bitfield name="INT7" caption="External Interrupt 7" mask="0x80"/>
          <bitfield name="INT8" caption="External Interrupt 8" mask="0x100"/>
          <bitfield name="INT9" caption="External Interrupt 9" mask="0x200"/>
          <bitfield name="INT10" caption="External Interrupt 10" mask="0x400"/>
          <bitfield name="INT11" caption="External Interrupt 11" mask="0x800"/>
          <bitfield name="INT12" caption="External Interrupt 12" mask="0x1000"/>
          <bitfield name="INT13" caption="External Interrupt 13" mask="0x2000"/>
          <bitfield name="INT14" caption="External Interrupt 14" mask="0x4000"/>
          <bitfield name="INT15" caption="External Interrupt 15" mask="0x8000"/>
        </register>
