turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l8/atdf/ATSAM4LC8A.atdf
        <register name="MODE" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Mode  register">
          <bitfield name="REFSEL" caption="Reference Clock Selection" mask="0x3"/>
          <bitfield name="REFNUM" caption="Number of Reference CLock Cycles" mask="0xFF00"/>
          <bitfield name="CLKSEL" caption="Clock Source Selection" mask="0x1F0000"/>
          <bitfield name="REFCEN" caption="Reference Clock Enable" mask="0x80000000"/>
        </register>
        <register name="STATUS" offset="0x8" rw="R" size="4" access-size="4" initval="0x00000000" caption="Status  register">
          <bitfield name="BUSY" caption="Frequency measurement on-going" mask="0x1"/>
          <bitfield name="RCLKBUSY" caption="Reference Clock busy" mask="0x2"/>
        </register>
        <register name="VALUE" offset="0xC" rw="R" size="4" access-size="4" initval="0x00000000" caption="Value register">
          <bitfield name="VALUE" caption="Measured frequency" mask="0xFFFFFF"/>
        </register>
        <register name="IER" offset="0x10" rw="W" size="4" access-size="4" atomic-op="set:IMR" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="DONE" caption="Frequency measurment done" mask="0x1"/>
          <bitfield name="RCLKRDY" caption="Reference Clock ready" mask="0x2"/>
        </register>
        <register name="IDR" offset="0x14" rw="W" size="4" access-size="4" atomic-op="clear:IMR" initval="0x00000000" caption="Interrupt Diable Register">
          <bitfield name="DONE" caption="Frequency measurment done" mask="0x1"/>
          <bitfield name="RCLKRDY" caption="Reference Clock ready" mask="0x2"/>
        </register>
        <register name="IMR" offset="0x18" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="DONE" caption="Frequency measurment done" mask="0x1"/>
          <bitfield name="RCLKRDY" caption="Reference Clock ready" mask="0x2"/>
        </register>
        <register name="ISR" offset="0x1C" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="DONE" caption="Frequency measurment done" mask="0x1"/>
          <bitfield name="RCLKRDY" caption="Reference Clock ready" mask="0x2"/>
        </register>
        <register name="ICR" offset="0x20" rw="W" size="4" access-size="4" atomic-op="clear:ISR" initval="0x00000000" caption="Interrupt Clear Register">
          <bitfield name="DONE" caption="Frequency measurment done" mask="0x1"/>
          <bitfield name="RCLKRDY" caption="Reference Clock ready" mask="0x2"/>
        </register>
        <register name="VERSION" offset="0x3FC" rw="R" size="4" access-size="4" initval="0x00000311" caption="Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
      </register-group>
    </module>
    <module name="GLOC" id="I7551" version="1.0.2" caption="Glue Logic Controller">
      <register-group name="LUT" size="0x8">
        <register name="CR" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="AEN" caption="Input mask" mask="0xF"/>
          <bitfield name="FILTEN" caption="Filter enable" mask="0x80000000"/>
        </register>
        <register name="TRUTH" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Truth Register">
          <bitfield name="TRUTH" caption="Truth" mask="0xFFFF"/>
        </register>
      </register-group>
      <register-group name="GLOC" caption="Glue Logic Controller">
        <register-group name="LUT" name-in-module="LUT" offset="0x00" count="2"/>
        <register name="PARAMETER" offset="0x38" rw="R" size="4" access-size="4" caption="Parameter Register">
          <bitfield name="LUTS" caption="LUTs" mask="0xFF"/>
        </register>
        <register name="VERSION" offset="0x3C" rw="R" size="4" access-size="4" initval="0x00000102" caption="Version Register">
          <bitfield name="VERSION" caption="Version" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant" mask="0xF0000"/>
        </register>
      </register-group>
    </module>
    <module name="GPIO" id="I7512" version="2.1.5" caption="General-Purpose Input/Output Controller">
      <register-group name="port" size="0x200">
        <register name="GPER" offset="0x0" rw="RW" size="4" access-size="4" caption="GPIO Enable Register">
          <bitfield name="P0" caption="GPIO Enable" mask="0x1"/>
          <bitfield name="P1" caption="GPIO Enable" mask="0x2"/>
          <bitfield name="P2" caption="GPIO Enable" mask="0x4"/>
          <bitfield name="P3" caption="GPIO Enable" mask="0x8"/>
          <bitfield name="P4" caption="GPIO Enable" mask="0x10"/>
          <bitfield name="P5" caption="GPIO Enable" mask="0x20"/>
          <bitfield name="P6" caption="GPIO Enable" mask="0x40"/>
          <bitfield name="P7" caption="GPIO Enable" mask="0x80"/>
          <bitfield name="P8" caption="GPIO Enable" mask="0x100"/>
          <bitfield name="P9" caption="GPIO Enable" mask="0x200"/>
          <bitfield name="P10" caption="GPIO Enable" mask="0x400"/>
          <bitfield name="P11" caption="GPIO Enable" mask="0x800"/>
          <bitfield name="P12" caption="GPIO Enable" mask="0x1000"/>
          <bitfield name="P13" caption="GPIO Enable" mask="0x2000"/>
          <bitfield name="P14" caption="GPIO Enable" mask="0x4000"/>
          <bitfield name="P15" caption="GPIO Enable" mask="0x8000"/>
          <bitfield name="P16" caption="GPIO Enable" mask="0x10000"/>
          <bitfield name="P17" caption="GPIO Enable" mask="0x20000"/>
          <bitfield name="P18" caption="GPIO Enable" mask="0x40000"/>
          <bitfield name="P19" caption="GPIO Enable" mask="0x80000"/>
          <bitfield name="P20" caption="GPIO Enable" mask="0x100000"/>
          <bitfield name="P21" caption="GPIO Enable" mask="0x200000"/>
          <bitfield name="P22" caption="GPIO Enable" mask="0x400000"/>
          <bitfield name="P23" caption="GPIO Enable" mask="0x800000"/>
          <bitfield name="P24" caption="GPIO Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="GPIO Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="GPIO Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="GPIO Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="GPIO Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="GPIO Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="GPIO Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="GPIO Enable" mask="0x80000000"/>
        </register>
        <register name="GPERS" offset="0x4" rw="W" size="4" access-size="4" atomic-op="set:GPER" caption="GPIO Enable Register - Set">
          <bitfield name="P0" caption="GPIO Enable" mask="0x1"/>
          <bitfield name="P1" caption="GPIO Enable" mask="0x2"/>
          <bitfield name="P2" caption="GPIO Enable" mask="0x4"/>
          <bitfield name="P3" caption="GPIO Enable" mask="0x8"/>
          <bitfield name="P4" caption="GPIO Enable" mask="0x10"/>
          <bitfield name="P5" caption="GPIO Enable" mask="0x20"/>
          <bitfield name="P6" caption="GPIO Enable" mask="0x40"/>
          <bitfield name="P7" caption="GPIO Enable" mask="0x80"/>
          <bitfield name="P8" caption="GPIO Enable" mask="0x100"/>
          <bitfield name="P9" caption="GPIO Enable" mask="0x200"/>
          <bitfield name="P10" caption="GPIO Enable" mask="0x400"/>
          <bitfield name="P11" caption="GPIO Enable" mask="0x800"/>
          <bitfield name="P12" caption="GPIO Enable" mask="0x1000"/>
          <bitfield name="P13" caption="GPIO Enable" mask="0x2000"/>
          <bitfield name="P14" caption="GPIO Enable" mask="0x4000"/>
          <bitfield name="P15" caption="GPIO Enable" mask="0x8000"/>
          <bitfield name="P16" caption="GPIO Enable" mask="0x10000"/>
          <bitfield name="P17" caption="GPIO Enable" mask="0x20000"/>
          <bitfield name="P18" caption="GPIO Enable" mask="0x40000"/>
          <bitfield name="P19" caption="GPIO Enable" mask="0x80000"/>
          <bitfield name="P20" caption="GPIO Enable" mask="0x100000"/>
          <bitfield name="P21" caption="GPIO Enable" mask="0x200000"/>
          <bitfield name="P22" caption="GPIO Enable" mask="0x400000"/>
          <bitfield name="P23" caption="GPIO Enable" mask="0x800000"/>
          <bitfield name="P24" caption="GPIO Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="GPIO Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="GPIO Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="GPIO Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="GPIO Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="GPIO Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="GPIO Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="GPIO Enable" mask="0x80000000"/>
        </register>
        <register name="GPERC" offset="0x8" rw="W" size="4" access-size="4" atomic-op="clear:GPER" caption="GPIO Enable Register - Clear">
          <bitfield name="P0" caption="GPIO Enable" mask="0x1"/>
          <bitfield name="P1" caption="GPIO Enable" mask="0x2"/>
          <bitfield name="P2" caption="GPIO Enable" mask="0x4"/>
          <bitfield name="P3" caption="GPIO Enable" mask="0x8"/>
          <bitfield name="P4" caption="GPIO Enable" mask="0x10"/>
          <bitfield name="P5" caption="GPIO Enable" mask="0x20"/>
          <bitfield name="P6" caption="GPIO Enable" mask="0x40"/>
          <bitfield name="P7" caption="GPIO Enable" mask="0x80"/>
          <bitfield name="P8" caption="GPIO Enable" mask="0x100"/>
          <bitfield name="P9" caption="GPIO Enable" mask="0x200"/>
          <bitfield name="P10" caption="GPIO Enable" mask="0x400"/>
          <bitfield name="P11" caption="GPIO Enable" mask="0x800"/>
          <bitfield name="P12" caption="GPIO Enable" mask="0x1000"/>
          <bitfield name="P13" caption="GPIO Enable" mask="0x2000"/>
          <bitfield name="P14" caption="GPIO Enable" mask="0x4000"/>
          <bitfield name="P15" caption="GPIO Enable" mask="0x8000"/>
          <bitfield name="P16" caption="GPIO Enable" mask="0x10000"/>
          <bitfield name="P17" caption="GPIO Enable" mask="0x20000"/>
          <bitfield name="P18" caption="GPIO Enable" mask="0x40000"/>
          <bitfield name="P19" caption="GPIO Enable" mask="0x80000"/>
          <bitfield name="P20" caption="GPIO Enable" mask="0x100000"/>
          <bitfield name="P21" caption="GPIO Enable" mask="0x200000"/>
          <bitfield name="P22" caption="GPIO Enable" mask="0x400000"/>
          <bitfield name="P23" caption="GPIO Enable" mask="0x800000"/>
          <bitfield name="P24" caption="GPIO Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="GPIO Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="GPIO Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="GPIO Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="GPIO Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="GPIO Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="GPIO Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="GPIO Enable" mask="0x80000000"/>
        </register>
        <register name="GPERT" offset="0xC" rw="W" size="4" access-size="4" atomic-op="toggle:GPER" caption="GPIO Enable Register - Toggle">
          <bitfield name="P0" caption="GPIO Enable" mask="0x1"/>
          <bitfield name="P1" caption="GPIO Enable" mask="0x2"/>
          <bitfield name="P2" caption="GPIO Enable" mask="0x4"/>
          <bitfield name="P3" caption="GPIO Enable" mask="0x8"/>
          <bitfield name="P4" caption="GPIO Enable" mask="0x10"/>
          <bitfield name="P5" caption="GPIO Enable" mask="0x20"/>
          <bitfield name="P6" caption="GPIO Enable" mask="0x40"/>
          <bitfield name="P7" caption="GPIO Enable" mask="0x80"/>
          <bitfield name="P8" caption="GPIO Enable" mask="0x100"/>
          <bitfield name="P9" caption="GPIO Enable" mask="0x200"/>
          <bitfield name="P10" caption="GPIO Enable" mask="0x400"/>
          <bitfield name="P11" caption="GPIO Enable" mask="0x800"/>
          <bitfield name="P12" caption="GPIO Enable" mask="0x1000"/>
          <bitfield name="P13" caption="GPIO Enable" mask="0x2000"/>
          <bitfield name="P14" caption="GPIO Enable" mask="0x4000"/>
          <bitfield name="P15" caption="GPIO Enable" mask="0x8000"/>
          <bitfield name="P16" caption="GPIO Enable" mask="0x10000"/>
          <bitfield name="P17" caption="GPIO Enable" mask="0x20000"/>
          <bitfield name="P18" caption="GPIO Enable" mask="0x40000"/>
          <bitfield name="P19" caption="GPIO Enable" mask="0x80000"/>
          <bitfield name="P20" caption="GPIO Enable" mask="0x100000"/>
          <bitfield name="P21" caption="GPIO Enable" mask="0x200000"/>
          <bitfield name="P22" caption="GPIO Enable" mask="0x400000"/>
          <bitfield name="P23" caption="GPIO Enable" mask="0x800000"/>
          <bitfield name="P24" caption="GPIO Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="GPIO Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="GPIO Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="GPIO Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="GPIO Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="GPIO Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="GPIO Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="GPIO Enable" mask="0x80000000"/>
        </register>
        <register name="PMR0" offset="0x10" rw="RW" size="4" access-size="4" caption="Peripheral Mux Register 0">
          <bitfield name="P0" caption="Peripheral Multiplexer Select bit 0" mask="0x1"/>
          <bitfield name="P1" caption="Peripheral Multiplexer Select bit 0" mask="0x2"/>
          <bitfield name="P2" caption="Peripheral Multiplexer Select bit 0" mask="0x4"/>
          <bitfield name="P3" caption="Peripheral Multiplexer Select bit 0" mask="0x8"/>
          <bitfield name="P4" caption="Peripheral Multiplexer Select bit 0" mask="0x10"/>
          <bitfield name="P5" caption="Peripheral Multiplexer Select bit 0" mask="0x20"/>
          <bitfield name="P6" caption="Peripheral Multiplexer Select bit 0" mask="0x40"/>
          <bitfield name="P7" caption="Peripheral Multiplexer Select bit 0" mask="0x80"/>
          <bitfield name="P8" caption="Peripheral Multiplexer Select bit 0" mask="0x100"/>
          <bitfield name="P9" caption="Peripheral Multiplexer Select bit 0" mask="0x200"/>
          <bitfield name="P10" caption="Peripheral Multiplexer Select bit 0" mask="0x400"/>
          <bitfield name="P11" caption="Peripheral Multiplexer Select bit 0" mask="0x800"/>
          <bitfield name="P12" caption="Peripheral Multiplexer Select bit 0" mask="0x1000"/>
          <bitfield name="P13" caption="Peripheral Multiplexer Select bit 0" mask="0x2000"/>
          <bitfield name="P14" caption="Peripheral Multiplexer Select bit 0" mask="0x4000"/>
          <bitfield name="P15" caption="Peripheral Multiplexer Select bit 0" mask="0x8000"/>
          <bitfield name="P16" caption="Peripheral Multiplexer Select bit 0" mask="0x10000"/>
          <bitfield name="P17" caption="Peripheral Multiplexer Select bit 0" mask="0x20000"/>
          <bitfield name="P18" caption="Peripheral Multiplexer Select bit 0" mask="0x40000"/>
          <bitfield name="P19" caption="Peripheral Multiplexer Select bit 0" mask="0x80000"/>
          <bitfield name="P20" caption="Peripheral Multiplexer Select bit 0" mask="0x100000"/>
          <bitfield name="P21" caption="Peripheral Multiplexer Select bit 0" mask="0x200000"/>
          <bitfield name="P22" caption="Peripheral Multiplexer Select bit 0" mask="0x400000"/>
          <bitfield name="P23" caption="Peripheral Multiplexer Select bit 0" mask="0x800000"/>
          <bitfield name="P24" caption="Peripheral Multiplexer Select bit 0" mask="0x1000000"/>
          <bitfield name="P25" caption="Peripheral Multiplexer Select bit 0" mask="0x2000000"/>
          <bitfield name="P26" caption="Peripheral Multiplexer Select bit 0" mask="0x4000000"/>
          <bitfield name="P27" caption="Peripheral Multiplexer Select bit 0" mask="0x8000000"/>
          <bitfield name="P28" caption="Peripheral Multiplexer Select bit 0" mask="0x10000000"/>
          <bitfield name="P29" caption="Peripheral Multiplexer Select bit 0" mask="0x20000000"/>
          <bitfield name="P30" caption="Peripheral Multiplexer Select bit 0" mask="0x40000000"/>
          <bitfield name="P31" caption="Peripheral Multiplexer Select bit 0" mask="0x80000000"/>
        </register>
        <register name="PMR0S" offset="0x14" rw="W" size="4" access-size="4" atomic-op="set:PMR0" caption="Peripheral Mux Register 0 - Set">
          <bitfield name="P0" caption="Peripheral Multiplexer Select bit 0" mask="0x1"/>
          <bitfield name="P1" caption="Peripheral Multiplexer Select bit 0" mask="0x2"/>
          <bitfield name="P2" caption="Peripheral Multiplexer Select bit 0" mask="0x4"/>
          <bitfield name="P3" caption="Peripheral Multiplexer Select bit 0" mask="0x8"/>
          <bitfield name="P4" caption="Peripheral Multiplexer Select bit 0" mask="0x10"/>
          <bitfield name="P5" caption="Peripheral Multiplexer Select bit 0" mask="0x20"/>
          <bitfield name="P6" caption="Peripheral Multiplexer Select bit 0" mask="0x40"/>
          <bitfield name="P7" caption="Peripheral Multiplexer Select bit 0" mask="0x80"/>
          <bitfield name="P8" caption="Peripheral Multiplexer Select bit 0" mask="0x100"/>
          <bitfield name="P9" caption="Peripheral Multiplexer Select bit 0" mask="0x200"/>
          <bitfield name="P10" caption="Peripheral Multiplexer Select bit 0" mask="0x400"/>
          <bitfield name="P11" caption="Peripheral Multiplexer Select bit 0" mask="0x800"/>
          <bitfield name="P12" caption="Peripheral Multiplexer Select bit 0" mask="0x1000"/>
          <bitfield name="P13" caption="Peripheral Multiplexer Select bit 0" mask="0x2000"/>
          <bitfield name="P14" caption="Peripheral Multiplexer Select bit 0" mask="0x4000"/>
          <bitfield name="P15" caption="Peripheral Multiplexer Select bit 0" mask="0x8000"/>
          <bitfield name="P16" caption="Peripheral Multiplexer Select bit 0" mask="0x10000"/>
          <bitfield name="P17" caption="Peripheral Multiplexer Select bit 0" mask="0x20000"/>
          <bitfield name="P18" caption="Peripheral Multiplexer Select bit 0" mask="0x40000"/>
          <bitfield name="P19" caption="Peripheral Multiplexer Select bit 0" mask="0x80000"/>
          <bitfield name="P20" caption="Peripheral Multiplexer Select bit 0" mask="0x100000"/>
          <bitfield name="P21" caption="Peripheral Multiplexer Select bit 0" mask="0x200000"/>
          <bitfield name="P22" caption="Peripheral Multiplexer Select bit 0" mask="0x400000"/>
          <bitfield name="P23" caption="Peripheral Multiplexer Select bit 0" mask="0x800000"/>
          <bitfield name="P24" caption="Peripheral Multiplexer Select bit 0" mask="0x1000000"/>
          <bitfield name="P25" caption="Peripheral Multiplexer Select bit 0" mask="0x2000000"/>
          <bitfield name="P26" caption="Peripheral Multiplexer Select bit 0" mask="0x4000000"/>
          <bitfield name="P27" caption="Peripheral Multiplexer Select bit 0" mask="0x8000000"/>
          <bitfield name="P28" caption="Peripheral Multiplexer Select bit 0" mask="0x10000000"/>
          <bitfield name="P29" caption="Peripheral Multiplexer Select bit 0" mask="0x20000000"/>
          <bitfield name="P30" caption="Peripheral Multiplexer Select bit 0" mask="0x40000000"/>
          <bitfield name="P31" caption="Peripheral Multiplexer Select bit 0" mask="0x80000000"/>
        </register>
        <register name="PMR0C" offset="0x18" rw="W" size="4" access-size="4" atomic-op="clear:PMR0" caption="Peripheral Mux Register 0 - Clear">
          <bitfield name="P0" caption="Peripheral Multiplexer Select bit 0" mask="0x1"/>
          <bitfield name="P1" caption="Peripheral Multiplexer Select bit 0" mask="0x2"/>
          <bitfield name="P2" caption="Peripheral Multiplexer Select bit 0" mask="0x4"/>
          <bitfield name="P3" caption="Peripheral Multiplexer Select bit 0" mask="0x8"/>
          <bitfield name="P4" caption="Peripheral Multiplexer Select bit 0" mask="0x10"/>
          <bitfield name="P5" caption="Peripheral Multiplexer Select bit 0" mask="0x20"/>
          <bitfield name="P6" caption="Peripheral Multiplexer Select bit 0" mask="0x40"/>
          <bitfield name="P7" caption="Peripheral Multiplexer Select bit 0" mask="0x80"/>
          <bitfield name="P8" caption="Peripheral Multiplexer Select bit 0" mask="0x100"/>
          <bitfield name="P9" caption="Peripheral Multiplexer Select bit 0" mask="0x200"/>
          <bitfield name="P10" caption="Peripheral Multiplexer Select bit 0" mask="0x400"/>
          <bitfield name="P11" caption="Peripheral Multiplexer Select bit 0" mask="0x800"/>
          <bitfield name="P12" caption="Peripheral Multiplexer Select bit 0" mask="0x1000"/>
          <bitfield name="P13" caption="Peripheral Multiplexer Select bit 0" mask="0x2000"/>
          <bitfield name="P14" caption="Peripheral Multiplexer Select bit 0" mask="0x4000"/>
          <bitfield name="P15" caption="Peripheral Multiplexer Select bit 0" mask="0x8000"/>
          <bitfield name="P16" caption="Peripheral Multiplexer Select bit 0" mask="0x10000"/>
          <bitfield name="P17" caption="Peripheral Multiplexer Select bit 0" mask="0x20000"/>
          <bitfield name="P18" caption="Peripheral Multiplexer Select bit 0" mask="0x40000"/>
          <bitfield name="P19" caption="Peripheral Multiplexer Select bit 0" mask="0x80000"/>
          <bitfield name="P20" caption="Peripheral Multiplexer Select bit 0" mask="0x100000"/>
          <bitfield name="P21" caption="Peripheral Multiplexer Select bit 0" mask="0x200000"/>
          <bitfield name="P22" caption="Peripheral Multiplexer Select bit 0" mask="0x400000"/>
          <bitfield name="P23" caption="Peripheral Multiplexer Select bit 0" mask="0x800000"/>
          <bitfield name="P24" caption="Peripheral Multiplexer Select bit 0" mask="0x1000000"/>
          <bitfield name="P25" caption="Peripheral Multiplexer Select bit 0" mask="0x2000000"/>
          <bitfield name="P26" caption="Peripheral Multiplexer Select bit 0" mask="0x4000000"/>
          <bitfield name="P27" caption="Peripheral Multiplexer Select bit 0" mask="0x8000000"/>
          <bitfield name="P28" caption="Peripheral Multiplexer Select bit 0" mask="0x10000000"/>
          <bitfield name="P29" caption="Peripheral Multiplexer Select bit 0" mask="0x20000000"/>
          <bitfield name="P30" caption="Peripheral Multiplexer Select bit 0" mask="0x40000000"/>
          <bitfield name="P31" caption="Peripheral Multiplexer Select bit 0" mask="0x80000000"/>
        </register>
