turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l8/atdf/ATSAM4LC8A.atdf
        <register name="LOCKC" offset="0x1A8" rw="W" size="4" access-size="4" atomic-op="clear:LOCK" caption="Lock Register - Clear">
          <bitfield name="P0" caption="Lock State" mask="0x1"/>
          <bitfield name="P1" caption="Lock State" mask="0x2"/>
          <bitfield name="P2" caption="Lock State" mask="0x4"/>
          <bitfield name="P3" caption="Lock State" mask="0x8"/>
          <bitfield name="P4" caption="Lock State" mask="0x10"/>
          <bitfield name="P5" caption="Lock State" mask="0x20"/>
          <bitfield name="P6" caption="Lock State" mask="0x40"/>
          <bitfield name="P7" caption="Lock State" mask="0x80"/>
          <bitfield name="P8" caption="Lock State" mask="0x100"/>
          <bitfield name="P9" caption="Lock State" mask="0x200"/>
          <bitfield name="P10" caption="Lock State" mask="0x400"/>
          <bitfield name="P11" caption="Lock State" mask="0x800"/>
          <bitfield name="P12" caption="Lock State" mask="0x1000"/>
          <bitfield name="P13" caption="Lock State" mask="0x2000"/>
          <bitfield name="P14" caption="Lock State" mask="0x4000"/>
          <bitfield name="P15" caption="Lock State" mask="0x8000"/>
          <bitfield name="P16" caption="Lock State" mask="0x10000"/>
          <bitfield name="P17" caption="Lock State" mask="0x20000"/>
          <bitfield name="P18" caption="Lock State" mask="0x40000"/>
          <bitfield name="P19" caption="Lock State" mask="0x80000"/>
          <bitfield name="P20" caption="Lock State" mask="0x100000"/>
          <bitfield name="P21" caption="Lock State" mask="0x200000"/>
          <bitfield name="P22" caption="Lock State" mask="0x400000"/>
          <bitfield name="P23" caption="Lock State" mask="0x800000"/>
          <bitfield name="P24" caption="Lock State" mask="0x1000000"/>
          <bitfield name="P25" caption="Lock State" mask="0x2000000"/>
          <bitfield name="P26" caption="Lock State" mask="0x4000000"/>
          <bitfield name="P27" caption="Lock State" mask="0x8000000"/>
          <bitfield name="P28" caption="Lock State" mask="0x10000000"/>
          <bitfield name="P29" caption="Lock State" mask="0x20000000"/>
          <bitfield name="P30" caption="Lock State" mask="0x40000000"/>
          <bitfield name="P31" caption="Lock State" mask="0x80000000"/>
        </register>
        <register name="LOCKT" offset="0x1AC" rw="W" size="4" access-size="4" atomic-op="toggle:LOCK" caption="Lock Register - Toggle">
          <bitfield name="P0" caption="Lock State" mask="0x1"/>
          <bitfield name="P1" caption="Lock State" mask="0x2"/>
          <bitfield name="P2" caption="Lock State" mask="0x4"/>
          <bitfield name="P3" caption="Lock State" mask="0x8"/>
          <bitfield name="P4" caption="Lock State" mask="0x10"/>
          <bitfield name="P5" caption="Lock State" mask="0x20"/>
          <bitfield name="P6" caption="Lock State" mask="0x40"/>
          <bitfield name="P7" caption="Lock State" mask="0x80"/>
          <bitfield name="P8" caption="Lock State" mask="0x100"/>
          <bitfield name="P9" caption="Lock State" mask="0x200"/>
          <bitfield name="P10" caption="Lock State" mask="0x400"/>
          <bitfield name="P11" caption="Lock State" mask="0x800"/>
          <bitfield name="P12" caption="Lock State" mask="0x1000"/>
          <bitfield name="P13" caption="Lock State" mask="0x2000"/>
          <bitfield name="P14" caption="Lock State" mask="0x4000"/>
          <bitfield name="P15" caption="Lock State" mask="0x8000"/>
          <bitfield name="P16" caption="Lock State" mask="0x10000"/>
          <bitfield name="P17" caption="Lock State" mask="0x20000"/>
          <bitfield name="P18" caption="Lock State" mask="0x40000"/>
          <bitfield name="P19" caption="Lock State" mask="0x80000"/>
          <bitfield name="P20" caption="Lock State" mask="0x100000"/>
          <bitfield name="P21" caption="Lock State" mask="0x200000"/>
          <bitfield name="P22" caption="Lock State" mask="0x400000"/>
          <bitfield name="P23" caption="Lock State" mask="0x800000"/>
          <bitfield name="P24" caption="Lock State" mask="0x1000000"/>
          <bitfield name="P25" caption="Lock State" mask="0x2000000"/>
          <bitfield name="P26" caption="Lock State" mask="0x4000000"/>
          <bitfield name="P27" caption="Lock State" mask="0x8000000"/>
          <bitfield name="P28" caption="Lock State" mask="0x10000000"/>
          <bitfield name="P29" caption="Lock State" mask="0x20000000"/>
          <bitfield name="P30" caption="Lock State" mask="0x40000000"/>
          <bitfield name="P31" caption="Lock State" mask="0x80000000"/>
        </register>
        <register name="UNLOCK" offset="0x1E0" rw="W" size="4" access-size="4" caption="Unlock Register">
          <bitfield name="ADDR" caption="Offset Register" mask="0x3FF"/>
          <bitfield name="KEY" caption="Unlocking Key" mask="0xFF000000"/>
        </register>
        <register name="ASR" offset="0x1E4" rw="RW" size="4" access-size="4" caption="Access Status Register">
          <bitfield name="AR" caption="Access Error" mask="0x1"/>
        </register>
        <register name="PARAMETER" offset="0x1F8" rw="R" size="4" access-size="4" caption="Parameter Register">
          <bitfield name="PARAMETER" caption="Parameter" mask="0xFFFFFFFF"/>
        </register>
        <register name="VERSION" offset="0x1FC" rw="R" size="4" access-size="4" initval="0x00000215" caption="Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
      </register-group>
      <register-group name="GPIO" caption="General-Purpose Input/Output Controller">
        <register-group name="port" name-in-module="port" offset="0x000" count="3"/>
      </register-group>
    </module>
    <module name="HCACHE" id="I8323" version="1.0.1" caption="Cortex M I&amp;D Cache Controller">
      <register-group name="HCACHE" caption="Cortex M I&amp;D Cache Controller">
        <register name="CTRL" offset="0x8" rw="W" size="4" access-size="4" caption="Control Register">
          <bitfield name="CEN" caption="Cache Enable" mask="0x1" values="HCACHE_CTRL__CEN"/>
        </register>
        <register name="SR" offset="0xC" rw="RW" size="4" access-size="4" caption="Status Register">
          <bitfield name="CSTS" caption="Cache Controller Status" mask="0x1" values="HCACHE_SR__CSTS"/>
        </register>
        <register name="MAINT0" offset="0x20" rw="W" size="4" access-size="4" caption="Maintenance Register 0">
          <bitfield name="INVALL" caption="Cache Controller Invalidate All" mask="0x1" values="HCACHE_MAINT0__INVALL"/>
        </register>
