turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l8/atdf/ATSAM4LC8A.atdf
        <register name="IDR" offset="0x18" rw="W" size="4" access-size="4" atomic-op="clear:IMR" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="RDRF" caption="Receive Data Register Full Interrupt Disable" mask="0x1" values="SPI_IDR__RDRF"/>
          <bitfield name="TDRE" caption="Transmit Data Register Empty Interrupt Disable" mask="0x2" values="SPI_IDR__TDRE"/>
          <bitfield name="MODF" caption="Mode Fault Error Interrupt Disable" mask="0x4" values="SPI_IDR__MODF"/>
          <bitfield name="OVRES" caption="Overrun Error Interrupt Disable" mask="0x8" values="SPI_IDR__OVRES"/>
          <bitfield name="ENDRX" caption="End of Receive Buffer Interrupt Disable" mask="0x10" values="SPI_IDR__ENDRX"/>
          <bitfield name="ENDTX" caption="End of Transmit Buffer Interrupt Disable" mask="0x20" values="SPI_IDR__ENDTX"/>
          <bitfield name="RXBUFF" caption="Receive Buffer Full Interrupt Disable" mask="0x40" values="SPI_IDR__RXBUFF"/>
          <bitfield name="TXBUFE" caption="Transmit Buffer Empty Interrupt Disable" mask="0x80" values="SPI_IDR__TXBUFE"/>
          <bitfield name="NSSR" caption="NSS Rising Interrupt Disable" mask="0x100" values="SPI_IDR__NSSR"/>
          <bitfield name="TXEMPTY" caption="Transmission Registers Empty Disable" mask="0x200" values="SPI_IDR__TXEMPTY"/>
          <bitfield name="UNDES" caption="Underrun Error Interrupt Disable" mask="0x400"/>
        </register>
        <register name="IMR" offset="0x1C" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="RDRF" caption="Receive Data Register Full Interrupt Mask" mask="0x1" values="SPI_IMR__RDRF"/>
          <bitfield name="TDRE" caption="Transmit Data Register Empty Interrupt Mask" mask="0x2" values="SPI_IMR__TDRE"/>
          <bitfield name="MODF" caption="Mode Fault Error Interrupt Mask" mask="0x4" values="SPI_IMR__MODF"/>
          <bitfield name="OVRES" caption="Overrun Error Interrupt Mask" mask="0x8" values="SPI_IMR__OVRES"/>
          <bitfield name="ENDRX" caption="End of Receive Buffer Interrupt Mask" mask="0x10" values="SPI_IMR__ENDRX"/>
          <bitfield name="ENDTX" caption="End of Transmit Buffer Interrupt Mask" mask="0x20" values="SPI_IMR__ENDTX"/>
          <bitfield name="RXBUFF" caption="Receive Buffer Full Interrupt Mask" mask="0x40" values="SPI_IMR__RXBUFF"/>
          <bitfield name="TXBUFE" caption="Transmit Buffer Empty Interrupt Mask" mask="0x80" values="SPI_IMR__TXBUFE"/>
          <bitfield name="NSSR" caption="NSS Rising Interrupt Mask" mask="0x100" values="SPI_IMR__NSSR"/>
          <bitfield name="TXEMPTY" caption="Transmission Registers Empty Mask" mask="0x200" values="SPI_IMR__TXEMPTY"/>
          <bitfield name="UNDES" caption="Underrun Error Interrupt Mask" mask="0x400"/>
        </register>
        <register name="CSR" offset="0x30" rw="RW" size="4" access-size="4" count="4" initval="0x00000000" caption="Chip Select Register">
          <bitfield name="CPOL" caption="Clock Polarity" mask="0x1" values="SPI_CSR__CPOL"/>
          <bitfield name="NCPHA" caption="Clock Phase" mask="0x2" values="SPI_CSR__NCPHA"/>
          <bitfield name="CSNAAT" caption="Chip Select Not Active After Transfer" mask="0x4"/>
          <bitfield name="CSAAT" caption="Chip Select Active After Transfer" mask="0x8" values="SPI_CSR__CSAAT"/>
          <bitfield name="BITS" caption="Bits Per Transfer" mask="0xF0" values="SPI_CSR__BITS"/>
          <bitfield name="SCBR" caption="Serial Clock Baud Rate" mask="0xFF00"/>
          <bitfield name="DLYBS" caption="Delay Before SPCK" mask="0xFF0000"/>
          <bitfield name="DLYBCT" caption="Delay Between Consecutive Transfers" mask="0xFF000000"/>
        </register>
        <register name="WPCR" offset="0xE4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Write Protection control Register">
          <bitfield name="WPEN" caption="Write Protection Enable" mask="0x1"/>
          <bitfield name="WPKEY" caption="Write Protection Key Password" mask="0xFFFFFF00" values="SPI_WPCR__WPKEY"/>
        </register>
        <register name="WPSR" offset="0xE8" rw="R" size="4" access-size="4" initval="0x00000000" caption="Write Protection status Register">
          <bitfield name="WPVS" caption="Write Protection Violation Status" mask="0x7" values="SPI_WPSR__WPVS"/>
          <bitfield name="WPVSRC" caption="Write Protection Violation Source" mask="0xFF00"/>
        </register>
        <register name="FEATURES" offset="0xF8" rw="R" size="4" access-size="4" caption="Features Register">
          <bitfield name="NCS" caption="Number of Chip Selects" mask="0xF"/>
          <bitfield name="PCONF" caption="Polarity is Configurable" mask="0x10"/>
          <bitfield name="PPNCONF" caption="Polarity is Positive if Polarity is not Configurable" mask="0x20"/>
          <bitfield name="PHCONF" caption="Phase is Configurable" mask="0x40"/>
          <bitfield name="PHZNCONF" caption="Phase is Zero if Phase is not Configurable" mask="0x80"/>
          <bitfield name="LENCONF" caption="Character Length is Configurable" mask="0x100"/>
          <bitfield name="LENNCONF" caption="Character Length if not Configurable" mask="0xFE00"/>
          <bitfield name="EXTDEC" caption="External Decoder is True" mask="0x10000"/>
          <bitfield name="CSNAATIMPL" caption="CSNAAT Features are Implemented" mask="0x20000"/>
          <bitfield name="BRPBHSB" caption="Bridge Type is PB to HSB" mask="0x40000"/>
          <bitfield name="FIFORIMPL" caption="FIFO in Reception is Implemented" mask="0x80000"/>
          <bitfield name="SWPIMPL" caption="Spurious Write Protection is Implemented" mask="0x100000"/>
        </register>
        <register name="VERSION" offset="0xFC" rw="R" size="4" access-size="4" initval="0x00000211" caption="Version Register">
          <bitfield name="VERSION" caption="Version" mask="0xFFF"/>
          <bitfield name="MFN" caption="mfn" mask="0x70000"/>
        </register>
      </register-group>
