turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l8/atdf/ATSAM4LC8A.atdf
      <value-group name="TC_CMR__WAVSEL">
        <value name="UP_NO_AUTO" caption="UP mode without automatic trigger on RC Compare" value="0"/>
        <value name="UPDOWN_NO_AUTO" caption="UPDOWN mode without automatic trigger on RC Compare" value="1"/>
        <value name="UP_AUTO" caption="UP mode with automatic trigger on RC Compare" value="2"/>
        <value name="UPDOWN_AUTO" caption="UPDOWN mode with automatic trigger on RC Compare" value="3"/>
      </value-group>
      <value-group name="TC_SR__CLKSTA">
        <value name="0" caption="Clock is disabled." value="0"/>
        <value name="1" caption="Clock is enabled." value="1"/>
      </value-group>
      <value-group name="TC_SR__COVFS">
        <value name="0" caption="No counter overflow has occurred since the last read of the Status Register." value="0"/>
        <value name="1" caption="A counter overflow has occurred since the last read of the Status Register." value="1"/>
      </value-group>
      <value-group name="TC_SR__CPAS">
        <value name="0" caption="RA Compare has not occurred since the last read of the Status Register or WAVE:0." value="0"/>
        <value name="1" caption="RA Compare has occurred since the last read of the Status Register, if WAVE:1." value="1"/>
      </value-group>
      <value-group name="TC_SR__CPBS">
        <value name="0" caption="RB Compare has not occurred since the last read of the Status Register or WAVE:0." value="0"/>
        <value name="1" caption="RB Compare has occurred since the last read of the Status Register, if WAVE:1." value="1"/>
      </value-group>
      <value-group name="TC_SR__CPCS">
        <value name="0" caption="RC Compare has not occurred since the last read of the Status Register." value="0"/>
        <value name="1" caption="RC Compare has occurred since the last read of the Status Register." value="1"/>
      </value-group>
      <value-group name="TC_SR__ETRGS">
        <value name="0" caption="External trigger has not occurred since the last read of the Status Register." value="0"/>
        <value name="1" caption="External trigger has occurred since the last read of the Status Register." value="1"/>
      </value-group>
      <value-group name="TC_SR__LDRAS">
        <value name="0" caption="RA Load has not occurred since the last read of the Status Register or WAVE:1." value="0"/>
        <value name="1" caption="RA Load has occurred since the last read of the Status Register, if WAVE:0." value="1"/>
      </value-group>
      <value-group name="TC_SR__LDRBS">
        <value name="0" caption="RB Load has not occurred since the last read of the Status Register or WAVE:1." value="0"/>
        <value name="1" caption="RB Load has occurred since the last read of the Status Register, if WAVE:0." value="1"/>
      </value-group>
      <value-group name="TC_SR__LOVRS">
        <value name="0" caption="Load overrun has not occurred since the last read of the Status Register or WAVE:1." value="0"/>
        <value name="1" caption="RA or RB have been loaded at least twice without any read of the corresponding register since the last read of the StatusRegister, if WAVE:0." value="1"/>
      </value-group>
      <value-group name="TC_SR__MTIOA">
        <value name="0" caption="TIOA is low. If WAVE:0, this means that TIOA pin is low. If WAVE:1, this means that TIOA is driven low." value="0"/>
        <value name="1" caption="TIOA is high. If WAVE:0, this means that TIOA pin is high. If WAVE:1, this means that TIOA is driven high." value="1"/>
      </value-group>
      <value-group name="TC_SR__MTIOB">
        <value name="0" caption="TIOB is low. If WAVE:0, this means that TIOB pin is low. If WAVE:1, this means that TIOB is driven low." value="0"/>
        <value name="1" caption="TIOB is high. If WAVE:0, this means that TIOB pin is high. If WAVE:1, this means that TIOB is driven high." value="1"/>
      </value-group>
      <value-group name="TC_IER__COVFS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the Counter Overflow Interrupt." value="1"/>
      </value-group>
      <value-group name="TC_IER__CPAS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the RA Compare Interrupt." value="1"/>
      </value-group>
      <value-group name="TC_IER__CPBS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the RB Compare Interrupt." value="1"/>
      </value-group>
      <value-group name="TC_IER__CPCS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the RC Compare Interrupt." value="1"/>
      </value-group>
      <value-group name="TC_IER__ETRGS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the External Trigger Interrupt." value="1"/>
      </value-group>
      <value-group name="TC_IER__LDRAS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the RA Load Interrupt." value="1"/>
      </value-group>
      <value-group name="TC_IER__LDRBS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the RB Load Interrupt." value="1"/>
      </value-group>
      <value-group name="TC_IER__LOVRS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the Load Overrun Interrupt." value="1"/>
      </value-group>
      <value-group name="TC_IDR__COVFS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the Counter Overflow Interrupt." value="1"/>
      </value-group>
      <value-group name="TC_IDR__CPAS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the RA Compare Interrupt (if WAVE:1)." value="1"/>
      </value-group>
      <value-group name="TC_IDR__CPBS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the RB Compare Interrupt (if WAVE:1)." value="1"/>
      </value-group>
      <value-group name="TC_IDR__CPCS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the RC Compare Interrupt." value="1"/>
      </value-group>
      <value-group name="TC_IDR__ETRGS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the External Trigger Interrupt." value="1"/>
      </value-group>
      <value-group name="TC_IDR__LDRAS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the RA Load Interrupt (if WAVE:0)." value="1"/>
      </value-group>
