turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l8/atdf/ATSAM4LC8A.atdf
        <register name="UPSTA4" offset="0x540" rw="R" size="4" access-size="4" initval="0x00000000" caption="Pipe Status Register">
          <bitfield name="RXINI" caption="Received IN Data Interrupt" mask="0x1"/>
          <bitfield name="TXOUTI" caption="Transmitted OUT Data Interrupt" mask="0x2"/>
          <bitfield name="TXSTPI" caption="Transmitted SETUP Interrupt" mask="0x4"/>
          <bitfield name="PERRI" caption="Pipe Error Interrupt" mask="0x8"/>
          <bitfield name="NAKEDI" caption="NAKed Interrupt" mask="0x10"/>
          <bitfield name="ERRORFI" caption="Errorflow Interrupt" mask="0x20"/>
          <bitfield name="RXSTALLDI" caption="Received STALLed Interrupt" mask="0x40"/>
          <bitfield name="DTSEQ" caption="Data Toggle Sequence" mask="0x300"/>
          <bitfield name="RAMACERI" caption="Ram Access Error Interrupt" mask="0x400"/>
          <bitfield name="NBUSYBK" caption="Number of Busy Bank" mask="0x3000"/>
          <bitfield name="CURRBK" caption="Current Bank" mask="0xC000"/>
        </register>
        <register name="UPSTA5" offset="0x544" rw="R" size="4" access-size="4" initval="0x00000000" caption="Pipe Status Register">
          <bitfield name="RXINI" caption="Received IN Data Interrupt" mask="0x1"/>
          <bitfield name="TXOUTI" caption="Transmitted OUT Data Interrupt" mask="0x2"/>
          <bitfield name="TXSTPI" caption="Transmitted SETUP Interrupt" mask="0x4"/>
          <bitfield name="PERRI" caption="Pipe Error Interrupt" mask="0x8"/>
          <bitfield name="NAKEDI" caption="NAKed Interrupt" mask="0x10"/>
          <bitfield name="ERRORFI" caption="Errorflow Interrupt" mask="0x20"/>
          <bitfield name="RXSTALLDI" caption="Received STALLed Interrupt" mask="0x40"/>
          <bitfield name="DTSEQ" caption="Data Toggle Sequence" mask="0x300"/>
          <bitfield name="RAMACERI" caption="Ram Access Error Interrupt" mask="0x400"/>
          <bitfield name="NBUSYBK" caption="Number of Busy Bank" mask="0x3000"/>
          <bitfield name="CURRBK" caption="Current Bank" mask="0xC000"/>
        </register>
        <register name="UPSTA6" offset="0x548" rw="R" size="4" access-size="4" initval="0x00000000" caption="Pipe Status Register">
          <bitfield name="RXINI" caption="Received IN Data Interrupt" mask="0x1"/>
          <bitfield name="TXOUTI" caption="Transmitted OUT Data Interrupt" mask="0x2"/>
          <bitfield name="TXSTPI" caption="Transmitted SETUP Interrupt" mask="0x4"/>
          <bitfield name="PERRI" caption="Pipe Error Interrupt" mask="0x8"/>
          <bitfield name="NAKEDI" caption="NAKed Interrupt" mask="0x10"/>
          <bitfield name="ERRORFI" caption="Errorflow Interrupt" mask="0x20"/>
          <bitfield name="RXSTALLDI" caption="Received STALLed Interrupt" mask="0x40"/>
          <bitfield name="DTSEQ" caption="Data Toggle Sequence" mask="0x300"/>
          <bitfield name="RAMACERI" caption="Ram Access Error Interrupt" mask="0x400"/>
          <bitfield name="NBUSYBK" caption="Number of Busy Bank" mask="0x3000"/>
          <bitfield name="CURRBK" caption="Current Bank" mask="0xC000"/>
        </register>
        <register name="UPSTA7" offset="0x54C" rw="R" size="4" access-size="4" initval="0x00000000" caption="Pipe Status Register">
          <bitfield name="RXINI" caption="Received IN Data Interrupt" mask="0x1"/>
          <bitfield name="TXOUTI" caption="Transmitted OUT Data Interrupt" mask="0x2"/>
          <bitfield name="TXSTPI" caption="Transmitted SETUP Interrupt" mask="0x4"/>
          <bitfield name="PERRI" caption="Pipe Error Interrupt" mask="0x8"/>
          <bitfield name="NAKEDI" caption="NAKed Interrupt" mask="0x10"/>
          <bitfield name="ERRORFI" caption="Errorflow Interrupt" mask="0x20"/>
          <bitfield name="RXSTALLDI" caption="Received STALLed Interrupt" mask="0x40"/>
          <bitfield name="DTSEQ" caption="Data Toggle Sequence" mask="0x300"/>
          <bitfield name="RAMACERI" caption="Ram Access Error Interrupt" mask="0x400"/>
          <bitfield name="NBUSYBK" caption="Number of Busy Bank" mask="0x3000"/>
          <bitfield name="CURRBK" caption="Current Bank" mask="0xC000"/>
        </register>
        <register name="UPSTA0CLR" offset="0x560" rw="W" size="4" access-size="4" atomic-op="clear:UPSTA0" initval="0x00000000" caption="Pipe Status Clear Register">
          <bitfield name="RXINIC" caption="RXINI Clear" mask="0x1"/>
          <bitfield name="TXOUTIC" caption="TXOUTI Clear" mask="0x2"/>
          <bitfield name="TXSTPIC" caption="TXSTPI Clear" mask="0x4"/>
          <bitfield name="PERRIC" caption="PERRI Clear" mask="0x8"/>
          <bitfield name="NAKEDIC" caption="NAKEDI Clear" mask="0x10"/>
          <bitfield name="ERRORFIC" caption="ERRORFI Clear" mask="0x20"/>
          <bitfield name="RXSTALLDIC" caption="RXSTALLDI Clear" mask="0x40"/>
          <bitfield name="RAMACERIC" caption="RAMACERI Clear" mask="0x400"/>
        </register>
        <register name="UPSTA1CLR" offset="0x564" rw="W" size="4" access-size="4" atomic-op="clear:UPSTA1" initval="0x00000000" caption="Pipe Status Clear Register">
          <bitfield name="RXINIC" caption="RXINI Clear" mask="0x1"/>
          <bitfield name="TXOUTIC" caption="TXOUTI Clear" mask="0x2"/>
          <bitfield name="TXSTPIC" caption="TXSTPI Clear" mask="0x4"/>
          <bitfield name="PERRIC" caption="PERRI Clear" mask="0x8"/>
          <bitfield name="NAKEDIC" caption="NAKEDI Clear" mask="0x10"/>
          <bitfield name="ERRORFIC" caption="ERRORFI Clear" mask="0x20"/>
          <bitfield name="RXSTALLDIC" caption="RXSTALLDI Clear" mask="0x40"/>
          <bitfield name="RAMACERIC" caption="RAMACERI Clear" mask="0x400"/>
        </register>
        <register name="UPSTA2CLR" offset="0x568" rw="W" size="4" access-size="4" atomic-op="clear:UPSTA2" initval="0x00000000" caption="Pipe Status Clear Register">
          <bitfield name="RXINIC" caption="RXINI Clear" mask="0x1"/>
          <bitfield name="TXOUTIC" caption="TXOUTI Clear" mask="0x2"/>
          <bitfield name="TXSTPIC" caption="TXSTPI Clear" mask="0x4"/>
          <bitfield name="PERRIC" caption="PERRI Clear" mask="0x8"/>
          <bitfield name="NAKEDIC" caption="NAKEDI Clear" mask="0x10"/>
          <bitfield name="ERRORFIC" caption="ERRORFI Clear" mask="0x20"/>
          <bitfield name="RXSTALLDIC" caption="RXSTALLDI Clear" mask="0x40"/>
          <bitfield name="RAMACERIC" caption="RAMACERI Clear" mask="0x400"/>
        </register>
        <register name="UPSTA3CLR" offset="0x56C" rw="W" size="4" access-size="4" atomic-op="clear:UPSTA3" initval="0x00000000" caption="Pipe Status Clear Register">
          <bitfield name="RXINIC" caption="RXINI Clear" mask="0x1"/>
          <bitfield name="TXOUTIC" caption="TXOUTI Clear" mask="0x2"/>
          <bitfield name="TXSTPIC" caption="TXSTPI Clear" mask="0x4"/>
          <bitfield name="PERRIC" caption="PERRI Clear" mask="0x8"/>
          <bitfield name="NAKEDIC" caption="NAKEDI Clear" mask="0x10"/>
          <bitfield name="ERRORFIC" caption="ERRORFI Clear" mask="0x20"/>
          <bitfield name="RXSTALLDIC" caption="RXSTALLDI Clear" mask="0x40"/>
          <bitfield name="RAMACERIC" caption="RAMACERI Clear" mask="0x400"/>
        </register>
        <register name="UPSTA4CLR" offset="0x570" rw="W" size="4" access-size="4" atomic-op="clear:UPSTA4" initval="0x00000000" caption="Pipe Status Clear Register">
          <bitfield name="RXINIC" caption="RXINI Clear" mask="0x1"/>
          <bitfield name="TXOUTIC" caption="TXOUTI Clear" mask="0x2"/>
          <bitfield name="TXSTPIC" caption="TXSTPI Clear" mask="0x4"/>
          <bitfield name="PERRIC" caption="PERRI Clear" mask="0x8"/>
          <bitfield name="NAKEDIC" caption="NAKEDI Clear" mask="0x10"/>
          <bitfield name="ERRORFIC" caption="ERRORFI Clear" mask="0x20"/>
          <bitfield name="RXSTALLDIC" caption="RXSTALLDI Clear" mask="0x40"/>
          <bitfield name="RAMACERIC" caption="RAMACERI Clear" mask="0x400"/>
        </register>
