turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l8/atdf/ATSAM4LC8A.atdf
                <register offset="0x00000360" size="1" name="NVICIP96" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI96" caption="Priority of interrupt 96"/>
                </register>
                <register offset="0x00000361" size="1" name="NVICIP97" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI97" caption="Priority of interrupt 97"/>
                </register>
                <register offset="0x00000362" size="1" name="NVICIP98" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI98" caption="Priority of interrupt 98"/>
                </register>
                <register offset="0x00000363" size="1" name="NVICIP99" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI99" caption="Priority of interrupt 99"/>
                </register>
                <register offset="0x00000364" size="1" name="NVICIP100" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI100" caption="Priority of interrupt 100"/>
                </register>
                <register offset="0x00000365" size="1" name="NVICIP101" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI101" caption="Priority of interrupt 101"/>
                </register>
                <register offset="0x00000366" size="1" name="NVICIP102" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI102" caption="Priority of interrupt 102"/>
                </register>
                <register offset="0x00000367" size="1" name="NVICIP103" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI103" caption="Priority of interrupt 103"/>
                </register>
                <register offset="0x00000368" size="1" name="NVICIP104" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI104" caption="Priority of interrupt 104"/>
                </register>
                <register offset="0x00000369" size="1" name="NVICIP105" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI105" caption="Priority of interrupt 105"/>
                </register>
                <register offset="0x00000e00" size="4" name="NVICSTIR" initval="0" caption="Software Trigger Interrupt Register">
                    <bitfield mask="0x000001ff" name="INTID" caption="Interrupt ID of the interrupt to trigger, in the range 0-239. For example, a value of 0x03 specifies interrupt IRQ3."/>
                </register>
            </register-group>
        </module><module name="MPU" caption="Memory Protection Unit Registers">
            <register-group name="MPU" caption="Memory Protection Unit">
                <register offset="0x00000000" size="4" name="MPU_TYPE" initval="0x00000800" caption="MPU Type Register" rw="R">
                    <bitfield mask="0x00000001" name="SEPARATE" caption="Indicates support for unified or separate instruction and date memory maps."/>
                    <bitfield mask="0x0000FF00" name="DREGION" caption="Indicates the number of supported MPU instruction regions."/>
                    <bitfield mask="0x00FF0000" name="IREGION" caption="Indicates the number of supported MPU data regions."/>
                </register>
                <register offset="0x00000004" size="4" name="MPU_CTRL" initval="0x00000000" caption="MPU Control Register" rw="RW">
                    <bitfield mask="0x00000001" name="ENABLE" caption="Enables the MPU"/>
                    <bitfield mask="0x00000002" name="HFNMIENA" caption="Enables the operation of MPU during hard fault, NMI, and FAULTMASK handlers."/>
                    <bitfield mask="0x00000004" name="PRIVDEFENA" caption="Enables privileged software access to the default memory map."/>
                </register>
                <register offset="0x00000008" size="4" name="MPU_RNR" initval="0x00000000" caption="MPU Region Number Register" rw="RW">
                    <bitfield mask="0x000000FF" name="REGION" caption="Indicates the MPU region referenced by the MPU_RBAR and MPU_RASR registers."/>
                </register>
                <register offset="0x0000000C" size="4" name="MPU_RBAR" initval="0x00000000" caption="MPU Region Base Address Register" rw="RW">
                    <bitfield mask="0x0000000F" name="REGION" caption="MPU region field."/>
                    <bitfield mask="0x00000010" name="VALID" caption="MPU Region Number valid bit."/>
                    <bitfield mask="0xFFFFFFE0" name="ADDR" caption="Region base address field."/>
                </register>
                <register offset="0x00000010" size="4" name="MPU_RASR" initval="0x00000000" caption="MPU Region Attribute and Size Register" rw="RW">
                    <bitfield mask="0x00000001" name="ENABLE" caption="Region enable bit."/>
                    <bitfield mask="0x0000003E" name="SIZE" caption="Specifies the size of the MPU protection region."/>
                    <bitfield mask="0x0000FF00" name="SRD" caption="Subregion disable bits."/>
                    <bitfield mask="0x00010000" name="B" caption="MPU access permission attributes."/>
                    <bitfield mask="0x00020000" name="C" caption="MPU access permission attributes."/>
                    <bitfield mask="0x00040000" name="S" caption="Shareable bit."/>
                    <bitfield mask="0x00380000" name="TEX" caption="MPU access permission attributes."/>
                    <bitfield mask="0x07000000" name="AP" caption="Access permission field."/>
                    <bitfield mask="0x10000000" name="XN" caption="Instruction access disable bit."/>
                </register>
            </register-group>
        </module></modules>
  <pinouts>
    <pinout name="QFP48" caption="QFP48">
      <pin position="1" pad="PA00"/>
      <pin position="2" pad="PA01"/>
      <pin position="3" pad="PA"/>
      <pin position="4" pad="RESET_N"/>
      <pin position="5" pad="VDDCORE"/>
      <pin position="6" pad="GNDIN"/>
      <pin position="7" pad="VDDOUT"/>
      <pin position="8" pad="VDDIN"/>
      <pin position="9" pad="TCK"/>
      <pin position="10" pad="PA"/>
      <pin position="11" pad="PA04"/>
      <pin position="12" pad="PA05"/>
      <pin position="13" pad="XIN32"/>
      <pin position="14" pad="XOUT32"/>
      <pin position="15" pad="PA"/>
      <pin position="16" pad="PA07"/>
      <pin position="17" pad="GNDANA"/>
      <pin position="18" pad="ADVREFP"/>
      <pin position="19" pad="VANA"/>
      <pin position="20" pad="PA08"/>
      <pin position="21" pad="PA09"/>
      <pin position="22" pad="PA10"/>
      <pin position="23" pad="PA11"/>
      <pin position="24" pad="PA12"/>
      <pin position="25" pad="CAPH"/>
      <pin position="26" pad="CAPL"/>
      <pin position="27" pad="VLCD"/>
      <pin position="28" pad="BIAS1"/>
      <pin position="29" pad="BIAS2"/>
      <pin position="30" pad="GNDIO00"/>
      <pin position="31" pad="VPUMP"/>
      <pin position="32" pad="PA"/>
      <pin position="33" pad="PA14"/>
      <pin position="34" pad="PA15"/>
      <pin position="35" pad="PA16"/>
      <pin position="36" pad="PA17"/>
      <pin position="37" pad="PA18"/>
      <pin position="38" pad="PA19"/>
      <pin position="39" pad="PA20"/>
      <pin position="40" pad="VDDIO"/>
      <pin position="41" pad="PA"/>
      <pin position="42" pad="PA"/>
      <pin position="43" pad="PA"/>
      <pin position="44" pad="PA"/>
      <pin position="45" pad="VDDIO04"/>
      <pin position="46" pad="PA25"/>
      <pin position="47" pad="PA26"/>
      <pin position="48" pad="GNDIO04"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>